[
  "Asphalt shingles typically last 20–30 years and are the most common residential roofing material.",
  "Architectural shingles are more durable and wind-resistant than 3-tab shingles.",
  "Metal roofs last 40–70 years, shed snow well, and come with higher upfront cost.",
  "EPDM, TPO, and PVC are common single-ply flat roof systems with different properties.",
  "Synthetic underlayment resists water better than traditional felt.",
  "Ice and water shield is essential along eaves, valleys, and penetrations in cold climates.",
  "Proper attic ventilation prevents moisture damage and extends roof life.",
  "Roof decking is usually OSB or plywood; damaged boards must be replaced during tear-off.",
  "Starter strip shingles prevent edge blow-offs and improve sealing.",
  "Drip edge metal directs water into gutters and protects fascia.",
  "Nails should be placed precisely in the shingle nail line—never too high or low.",
  "All flashing must be properly installed around chimneys, skylights, and dormers.",
  "Valleys can be installed as metal, cut, or woven; each has pros and cons.",
  "Tear-off installs are cleaner and longer-lasting than overlay.",
  "Pipe boots and wall junctions are frequent leak points.",
  "Ice dams are reduced by combining insulation, ventilation, and ice guard.",
  "Ridge cap shingles must overlap properly to prevent wind damage.",
  "Hail damage includes bruising, granule loss, and soft spots on shingles.",
  "Insurance carriers often require 8+ hail hits per square to approve claims.",
  "Most manufacturer warranties are void if installation doesn't follow spec.",
  "Vinyl siding is affordable and low-maintenance but cracks in cold climates.",
  "Fiber cement siding resists fire, pests, and rot but is heavy and harder to cut.",
  "Natural wood siding looks great but requires frequent maintenance.",
  "Engineered wood siding is lighter and easier to install than fiber cement.",
  "Aluminum siding is rustproof but easily dented.",
  "Composite siding mimics high-end finishes with low upkeep.",
  "Starter strip and J-channel are essential for secure siding installation.",
  "Nails should allow siding to float—never driven tight.",
  "Windows and doors must be flashed properly to prevent leaks.",
  "Furring strips may be needed to level uneven walls or add rain screen.",
  "House wrap acts as a weather barrier under siding.",
  "Water table and corner trim boards finish and protect edges.",
  "Caulk is used at joints on LP or Hardie, not vinyl.",
  "Hail damage includes cracks, breaks, and chipping on siding panels.",
  "Color fade warranties vary—some guarantee 10+ years without major discoloration.",
  "LP is easier to install; Hardie is tougher and more fire-resistant.",
  "Aluminum gutters are most common and affordable.",
  "Steel gutters are stronger but prone to rust.",
  "Copper gutters offer top performance and visual appeal at high cost.",
  "Vinyl gutters are inexpensive but brittle in cold climates.",
  "5-inch gutters are standard for residential; 6-inch for large or steep roofs.",
  "3x4 downspouts carry more water than 2x3s and reduce overflow.",
  "K-style gutters are common; half-round are more traditional and upscale.",
  "Gutters must slope ¼ inch per 10 feet toward downspouts.",
  "Hidden hangers outperform spike-and-ferrule systems.",
  "Gutter guards reduce clogs but can overflow if debris builds on top.",
  "Gutters must be installed under drip edge metal to catch all runoff.",
  "Kickout flashing prevents roof runoff from getting behind siding.",
  "Splash blocks or extensions prevent water from pooling near foundation.",
  "Clean gutters at least twice a year or more often near trees.",
  "Sagging, separation, rust, and peeling paint below gutters are signs of failure.",
  "Seamless gutters reduce leaks and look cleaner than sectional types.",
  "Downspouts must carry water 5+ feet away from the home.",
  "In cold climates, heat cables can prevent ice dams in gutters.",
  "Most homeowners don't understand roofing systems—use that to educate and build trust.",
  "When discussing attic ventilation, explain it prevents mold and heat damage.",
  "Bring sample shingles or siding to the appointment—physical products close deals.",
  "Use storm history tools to justify insurance claims with documented hail events.",
  "Bundle roofing, siding, and gutter work to increase job value and profit.",
  "Wealth consists not in having great possessions, but in having few wants. – Epictetus",
  "Formal education will make you a living; self-education will make you a fortune. – Jim Rohn",
  "The rich invest in time, the poor invest in money. – Warren Buffett",
  "It's not your salary that makes you rich, it's your spending habits. – Charles A. Jaffe",
  "Too many people spend money they haven't earned, to buy things they don't want, to impress people they don't like. – Will Rogers",
  "If you live for having it all, what you have is never enough. – Vicki Robin",
  "The lack of money is the root of all evil. – Mark Twain",
  "Wealth is the ability to fully experience life. – Henry David Thoreau",
  "Financial freedom is freedom from fear. – Robert Kiyosaki",
  "The real measure of your wealth is how much you'd be worth if you lost all your money. – Unknown",
  "A budget is telling your money where to go instead of wondering where it went. – Dave Ramsey",
  "You must gain control over your money or the lack of it will forever control you. – Dave Ramsey",
  "Money grows on the tree of persistence. – Japanese Proverb",
  "The person who doesn't know where his next dollar is coming from usually doesn't know where his last dollar went. – Unknown",
  "Don't tell me where your priorities are. Show me where you spend your money and I'll tell you what they are. – James W. Frick",
  "When you combine ignorance and leverage, you get some pretty interesting results. – Warren Buffett",
  "Rich people plan for three generations, poor people plan for Saturday night. – Gloria Steinem",
  "The goal isn't more money. The goal is living life on your terms. – Chris Brogan",
  "It is not the man who has too little, but the man who craves more, that is poor. – Seneca",
  "Don't let making a living prevent you from making a life. – John Wooden",
  "Success is walking from failure to failure with no loss of enthusiasm. – Winston Churchill",
  "The way to get started is to quit talking and begin doing. – Walt Disney",
  "Success usually comes to those who are too busy to be looking for it. – Henry David Thoreau",
  "I never dreamed about success. I worked for it. – Estée Lauder",
  "Success is not final; failure is not fatal: It is the courage to continue that counts. – Winston Churchill",
  "The only place where success comes before work is in the dictionary. – Vidal Sassoon",
  "Do not be embarrassed by your failures, learn from them and start again. – Richard Branson",
  "If you want to be successful, find someone who has achieved the results you want and copy what they do. – Tony Robbins",
  "Success is not the key to happiness. Happiness is the key to success. – Albert Schweitzer",
  "Success is the sum of small efforts repeated day in and day out. – Robert Collier",
  "Ambition is the path to success. Persistence is the vehicle you arrive in. – Bill Bradley",
  "Opportunities don't happen. You create them. – Chris Grosser",
  "There are no secrets to success. It is the result of preparation, hard work, and learning from failure. – Colin Powell",
  "What you get by achieving your goals is not as important as what you become by achieving your goals. – Zig Ziglar",
  "Success isn't just about what you accomplish. It's about what you inspire others to do. – Unknown",
  "I find that the harder I work, the more luck I seem to have. – Thomas Jefferson",
  "Success is liking yourself, liking what you do, and liking how you do it. – Maya Angelou",
  "The secret to success is to know something nobody else knows. – Aristotle Onassis",
  "Success does not consist in never making mistakes but in never making the same one a second time. – George Bernard Shaw",
  "Do not wait to strike till the iron is hot; but make it hot by striking. – William Butler Yeats",
  "Dream big. Start small. Act now. – Robin Sharma",
  "An entrepreneur is someone who jumps off a cliff and builds a plane on the way down. – Reid Hoffman",
  "If you don't find a way to make money while you sleep, you will work until you die. – Warren Buffett",
  "Success is getting what you want. Happiness is wanting what you get. – Dale Carnegie",
  "The best revenge is massive success. – Frank Sinatra",
  "Hustle until your haters ask if you're hiring. – Unknown",
  "Work like there is someone working 24 hours a day to take it away from you. – Mark Cuban",
  "Your time is limited, so don't waste it living someone else's life. – Steve Jobs",
  "Play by the rules, but be ferocious. – Phil Knight",
  "If everything seems under control, you're not going fast enough. – Mario Andretti",
  "Being realistic is the most commonly traveled road to mediocrity. – Will Smith",
  "Fall in love with the process and the results will come. – Eric Thomas",
  "Every great dream begins with a dreamer. – Harriet Tubman",
  "Don't watch the clock; do what it does. Keep going. – Sam Levenson",
  "Push yourself. No one else is going to do it for you. – Unknown",
  "Start where you are. Use what you have. Do what you can. – Arthur Ashe",
  "Discipline is doing what needs to be done, even if you don't want to do it. – Unknown",
  "Make it happen. Shock everyone. – Unknown",
  "Winners are not afraid of losing. But losers are. Failure is part of the process of success. – Robert Kiyosaki",
  "Don't be busy. Be productive. – Unknown",
  "Success is not about money, it's about legacy. – Jay Z",
  "He who is not courageous enough to take risks will accomplish nothing in life. – Muhammad Ali",
  "Don't limit your challenges. Challenge your limits. – Unknown",
  "Success is nothing more than a few simple disciplines practiced every day. – Jim Rohn",
  "Big results require big ambitions. – Heraclitus",
  "The harder you work for something, the greater you'll feel when you achieve it. – Unknown",
  "Success isn't owned. It's leased. And rent is due every day. – J.J. Watt",
  "Legacy is greater than currency. – Gary Vaynerchuk",
  "Average people have great ideas. Legends have great execution. – Unknown",
  "If you don't build your dream, someone will hire you to help build theirs. – Tony Gaskins",
  "Obsessed is a word the lazy use to describe the dedicated. – Unknown",
  "Excuses will always be there for you, opportunity won't. – Unknown",
  "The grind never stops, but neither do the rewards. – Unknown",
  "Success doesn't come to you, you go to it. – Marva Collins",
  "Be so good they can't ignore you. – Steve Martin",
  "Success begins at the edge of your comfort zone. – Unknown",
  "If you want to fly, give up everything that weighs you down. – Buddha",
  "Surround yourself with those who see greatness in you. – Unknown",
  "Act like you've already made it—until you really do. – Unknown",
  "Think like a millionaire. Hustle like you're broke. – Unknown",
  "Every accomplishment starts with the decision to try. – John F. Kennedy",
  "A millionaire is made 1 dollar at a time. – Unknown",
  "Live rich, not just look rich. – Naval Ravikant",
  "If you want more, become more. – Jim Rohn",
  "Be uncommon among the uncommon. – David Goggins",
  "You were not born to be mediocre. – Unknown",
  "Sacrifice today for a better tomorrow. – Unknown",
  "Winners focus on winning. Losers focus on winners. – Unknown",
  "You don't need more time. You need more focus. – Unknown",
  "You earn what you tolerate. – Unknown",
  "The greatest wealth is to live content with little. – Plato",
  "If not now, when? If not you, who? – Hillel the Elder",
  "Become addicted to the process and the outcome will follow. – Unknown",
  "Be patient. Money grows from consistency. – Unknown",
  "Passive income is freedom. Work for it relentlessly. – Unknown",
  "Millionaires don't use to-do lists, they use calendars. – Unknown",
  "The best time to plant a tree was 20 years ago. The second best time is now. – Chinese Proverb",
  "The rich see money as a tool. The poor see it as the goal. – Unknown",
  "Wake up early. Grind. Build. Repeat. – Unknown",
  "Your future is created by what you do today, not tomorrow. – Robert Kiyosaki"
]
